zephyrproject-rtos/zephyr/boards/microchip/pic32cxsg41_cult/support/svd/PIC32CX1025SG41064.svd
            <register>
               <dim>4</dim>
               <dimIncrement>4</dimIncrement>
               <name>INTVECTV[%s]</name>
               <description>Initialisation Vector n</description>
               <addressOffset>0x3C</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>INTVECTV</name>
                     <description>Initialization Vector Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>4</dim>
               <dimIncrement>4</dimIncrement>
               <name>HASHKEY[%s]</name>
               <description>Hash key n</description>
               <addressOffset>0x5C</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>HASHKEY</name>
                     <description>Hash Key Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>4</dim>
               <dimIncrement>4</dimIncrement>
               <name>GHASH[%s]</name>
               <description>Galois Hash n</description>
               <addressOffset>0x6C</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>GHASH</name>
                     <description>Galois Hash Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CIPLEN</name>
               <description>Cipher Length</description>
               <addressOffset>0x80</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CIPLEN</name>
                     <description>Cipher Length</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RANDSEED</name>
               <description>Random Seed</description>
               <addressOffset>0x84</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>RANDSEED</name>
                     <description>Random Seed</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
      <peripheral>
         <name>CCL</name>
         <version>U22251.1.0</version>
         <description>Configurable Custom Logic</description>
         <baseAddress>0x42003800</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x18</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>CTRL</name>
               <description>Control</description>
               <addressOffset>0x0</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>SWRST</name>
                     <description>Software Reset</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>SWRSTSelect</name>
                        <enumeratedValue>
                           <name>DISABLE</name>
                           <description>The peripheral is not reset</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLE</name>
                           <description>The peripheral is reset</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ENABLE</name>
                     <description>Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>ENABLESelect</name>
                        <enumeratedValue>
                           <name>DISABLE</name>
                           <description>The peripheral is disabled</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLE</name>
                           <description>The peripheral is enabled</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RUNSTDBY</name>
                     <description>Run in Standby</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>RUNSTDBYSelect</name>
                        <enumeratedValue>
                           <name>DISABLE</name>
                           <description>Generic clock is not required in standby sleep mode</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLE</name>
                           <description>Generic clock is  required in standby sleep mode</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <dim>2</dim>
               <dimIncrement>1</dimIncrement>
               <name>SEQCTRL[%s]</name>
               <description>SEQ Control x</description>
               <addressOffset>0x4</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>SEQSEL</name>
                     <description>Sequential Selection</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <name>SEQSELSelect</name>
                        <enumeratedValue>
                           <name>DISABLE</name>
                           <description>Sequential logic is disabled</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DFF</name>
                           <description>D flip flop</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>JK</name>
                           <description>JK flip flop</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LATCH</name>
                           <description>D latch</description>
                           <value>3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RS</name>
                           <description>RS latch</description>
                           <value>4</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <dim>4</dim>
               <dimIncrement>4</dimIncrement>
               <name>LUTCTRL[%s]</name>
               <description>LUT Control x</description>
               <addressOffset>0x8</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ENABLE</name>
                     <description>LUT Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>ENABLESelect</name>
                        <enumeratedValue>
                           <name>DISABLE</name>
                           <description>LUT block is disabled</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLE</name>
                           <description>LUT block is enabled</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FILTSEL</name>
                     <description>Filter Selection</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>FILTSELSelect</name>
                        <enumeratedValue>
                           <name>DISABLE</name>
                           <description>Filter disabled</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SYNCH</name>
                           <description>Synchronizer enabled</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FILTER</name>
                           <description>Filter enabled</description>
                           <value>2</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>EDGESEL</name>
                     <description>Edge Selection</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>EDGESELSelect</name>
                        <enumeratedValue>
                           <name>DISABLE</name>
                           <description>Edge detector is disabled</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLE</name>
                           <description>Edge detector is enabled</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>INSEL0</name>
                     <description>Input Selection 0</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <name>INSEL0Select</name>
                        <enumeratedValue>
                           <name>MASK</name>
                           <description>Masked input</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FEEDBACK</name>
                           <description>Feedback input source</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LINK</name>
                           <description>Linked LUT input source</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EVENT</name>
                           <description>Event input source</description>
                           <value>3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>IO</name>
                           <description>I/O pin input source</description>
                           <value>4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AC</name>
                           <description>AC input source</description>
                           <value>5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TC</name>
                           <description>TC input source</description>
                           <value>6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ALTTC</name>
                           <description>Alternate TC input source</description>
                           <value>7</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TCC</name>
                           <description>TCC input source</description>
                           <value>8</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SERCOM</name>
                           <description>SERCOM input source</description>
                           <value>9</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>INSEL1</name>
                     <description>Input Selection 1</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <name>INSEL1Select</name>
                        <enumeratedValue>
                           <name>MASK</name>
                           <description>Masked input</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FEEDBACK</name>
                           <description>Feedback input source</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LINK</name>
                           <description>Linked LUT input source</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EVENT</name>
                           <description>Event input source</description>
                           <value>3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>IO</name>
                           <description>I/O pin input source</description>
                           <value>4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AC</name>
                           <description>AC input source</description>
                           <value>5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TC</name>
                           <description>TC input source</description>
                           <value>6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ALTTC</name>
                           <description>Alternate TC input source</description>
                           <value>7</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TCC</name>
                           <description>TCC input source</description>
                           <value>8</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SERCOM</name>
                           <description>SERCOM input source</description>
                           <value>9</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>INSEL2</name>
                     <description>Input Selection 2</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <name>INSEL2Select</name>
                        <enumeratedValue>
                           <name>MASK</name>
                           <description>Masked input</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FEEDBACK</name>
                           <description>Feedback input source</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LINK</name>
                           <description>Linked LUT input source</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EVENT</name>
                           <description>Event input source</description>
                           <value>3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>IO</name>
                           <description>I/O pin input source</description>
                           <value>4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AC</name>
                           <description>AC input source</description>
                           <value>5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TC</name>
                           <description>TC input source</description>
                           <value>6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ALTTC</name>
                           <description>Alternate TC input source</description>
                           <value>7</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TCC</name>
                           <description>TCC input source</description>
                           <value>8</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SERCOM</name>
                           <description>SERCOM input source</description>
                           <value>9</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>INVEI</name>
                     <description>Inverted Event Input Enable</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>INVEISelect</name>
                        <enumeratedValue>
                           <name>DISABLE</name>
                           <description>Incoming event is not inverted</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLE</name>
                           <description>Incoming event is inverted</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>LUTEI</name>
                     <description>LUT Event Input Enable</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>LUTEISelect</name>
                        <enumeratedValue>
                           <name>DISABLE</name>
                           <description>LUT incoming event is disabled</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLE</name>
                           <description>LUT incoming event is enabled</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>LUTEO</name>
                     <description>LUT Event Output Enable</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>LUTEOSelect</name>
                        <enumeratedValue>
                           <name>DISABLE</name>
                           <description>LUT event output is disabled</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLE</name>
                           <description>LUT event output is enabled</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TRUTH</name>
                     <description>Truth Value</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
