zephyrproject-rtos/zephyr/boards/microchip/pic32cxsg41_cult/support/svd/PIC32CX1025SG41064.svd
            <register>
               <name>SWTRIGCTRL</name>
               <description>Software Trigger Control</description>
               <addressOffset>0x10</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SWTRIG0</name>
                     <description>Channel 0 Software Trigger</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWTRIG1</name>
                     <description>Channel 1 Software Trigger</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWTRIG2</name>
                     <description>Channel 2 Software Trigger</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWTRIG3</name>
                     <description>Channel 3 Software Trigger</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWTRIG4</name>
                     <description>Channel 4 Software Trigger</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWTRIG5</name>
                     <description>Channel 5 Software Trigger</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWTRIG6</name>
                     <description>Channel 6 Software Trigger</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWTRIG7</name>
                     <description>Channel 7 Software Trigger</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWTRIG8</name>
                     <description>Channel 8 Software Trigger</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWTRIG9</name>
                     <description>Channel 9 Software Trigger</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWTRIG10</name>
                     <description>Channel 10 Software Trigger</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWTRIG11</name>
                     <description>Channel 11 Software Trigger</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWTRIG12</name>
                     <description>Channel 12 Software Trigger</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWTRIG13</name>
                     <description>Channel 13 Software Trigger</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWTRIG14</name>
                     <description>Channel 14 Software Trigger</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWTRIG15</name>
                     <description>Channel 15 Software Trigger</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWTRIG16</name>
                     <description>Channel 16 Software Trigger</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWTRIG17</name>
                     <description>Channel 17 Software Trigger</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWTRIG18</name>
                     <description>Channel 18 Software Trigger</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWTRIG19</name>
                     <description>Channel 19 Software Trigger</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWTRIG20</name>
                     <description>Channel 20 Software Trigger</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWTRIG21</name>
                     <description>Channel 21 Software Trigger</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWTRIG22</name>
                     <description>Channel 22 Software Trigger</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWTRIG23</name>
                     <description>Channel 23 Software Trigger</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWTRIG24</name>
                     <description>Channel 24 Software Trigger</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWTRIG25</name>
                     <description>Channel 25 Software Trigger</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWTRIG26</name>
                     <description>Channel 26 Software Trigger</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWTRIG27</name>
                     <description>Channel 27 Software Trigger</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWTRIG28</name>
                     <description>Channel 28 Software Trigger</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWTRIG29</name>
                     <description>Channel 29 Software Trigger</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWTRIG30</name>
                     <description>Channel 30 Software Trigger</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWTRIG31</name>
                     <description>Channel 31 Software Trigger</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PRICTRL0</name>
               <description>Priority Control 0</description>
               <addressOffset>0x14</addressOffset>
               <size>32</size>
               <resetValue>0x40404040</resetValue>
               <fields>
                  <field>
                     <name>LVLPRI0</name>
                     <description>Level 0 Channel Priority Number</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>QOS0</name>
                     <description>Level 0 Quality of Service</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>QOS0Select</name>
                        <enumeratedValue>
                           <name>DISABLE</name>
                           <description>Regular delivery</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LOW</name>
                           <description>Bandwidth shortage</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>MEDIUM</name>
                           <description>Latency sensitive</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>HIGH</name>
                           <description>Latency critical</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RRLVLEN0</name>
                     <description>Level 0 Round-Robin Scheduling Enable</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LVLPRI1</name>
                     <description>Level 1 Channel Priority Number</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>QOS1</name>
                     <description>Level 1 Quality of Service</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>QOS1Select</name>
                        <enumeratedValue>
                           <name>DISABLE</name>
                           <description>Regular delivery</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LOW</name>
                           <description>Bandwidth shortage</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>MEDIUM</name>
                           <description>Latency sensitive</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>HIGH</name>
                           <description>Latency critical</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RRLVLEN1</name>
                     <description>Level 1 Round-Robin Scheduling Enable</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LVLPRI2</name>
                     <description>Level 2 Channel Priority Number</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>QOS2</name>
                     <description>Level 2 Quality of Service</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>QOS2Select</name>
                        <enumeratedValue>
                           <name>DISABLE</name>
                           <description>Regular delivery</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LOW</name>
                           <description>Bandwidth shortage</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>MEDIUM</name>
                           <description>Latency sensitive</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>HIGH</name>
                           <description>Latency critical</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RRLVLEN2</name>
                     <description>Level 2 Round-Robin Scheduling Enable</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LVLPRI3</name>
                     <description>Level 3 Channel Priority Number</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>QOS3</name>
                     <description>Level 3 Quality of Service</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>QOS3Select</name>
                        <enumeratedValue>
                           <name>DISABLE</name>
                           <description>Regular delivery</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LOW</name>
                           <description>Bandwidth shortage</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>MEDIUM</name>
                           <description>Latency sensitive</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>HIGH</name>
                           <description>Latency critical</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RRLVLEN3</name>
                     <description>Level 3 Round-Robin Scheduling Enable</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>INTPEND</name>
               <description>Interrupt Pending</description>
               <addressOffset>0x20</addressOffset>
               <size>16</size>
               <resetValue>0x0000</resetValue>
               <fields>
                  <field>
                     <name>ID</name>
                     <description>Channel ID</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>TERR</name>
                     <description>Transfer Error</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TCMPL</name>
                     <description>Transfer Complete</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SUSP</name>
                     <description>Channel Suspend</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CRCERR</name>
                     <description>CRC Error</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FERR</name>
                     <description>Fetch Error</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BUSY</name>
                     <description>Busy</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PEND</name>
                     <description>Pending</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
