zephyrproject-rtos/zephyr/boards/microchip/pic32cxsg41_cult/support/svd/PIC32CX1025SG41064.svd
            <cluster>
               <name>HOST</name>
               <description>USB is Host</description>
               <alternateCluster>DEVICE</alternateCluster>
               <headerStructName>UsbHost</headerStructName>
               <addressOffset>0x0</addressOffset>
               <register>
                  <name>CTRLA</name>
                  <description>Control A</description>
                  <addressOffset>0x0</addressOffset>
                  <size>8</size>
                  <resetValue>0x00</resetValue>
                  <fields>
                     <field>
                        <name>SWRST</name>
                        <description>Software Reset</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>ENABLE</name>
                        <description>Enable</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>RUNSTDBY</name>
                        <description>Run in Standby Mode</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>MODE</name>
                        <description>Operating Mode</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <name>MODESelect</name>
                           <enumeratedValue>
                              <name>DEVICE</name>
                              <description>Device Mode</description>
                              <value>0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>HOST</name>
                              <description>Host Mode</description>
                              <value>1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>SYNCBUSY</name>
                  <description>Synchronization Busy</description>
                  <addressOffset>0x2</addressOffset>
                  <size>8</size>
                  <access>read-only</access>
                  <resetValue>0x00</resetValue>
                  <fields>
                     <field>
                        <name>SWRST</name>
                        <description>Software Reset Synchronization Busy</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>ENABLE</name>
                        <description>Enable Synchronization Busy</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>QOSCTRL</name>
                  <description>USB Quality Of Service</description>
                  <addressOffset>0x3</addressOffset>
                  <size>8</size>
                  <resetValue>0x0F</resetValue>
                  <fields>
                     <field>
                        <name>CQOS</name>
                        <description>Configuration Quality of Service</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>2</bitWidth>
                     </field>
                     <field>
                        <name>DQOS</name>
                        <description>Data Quality of Service</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>2</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>CTRLB</name>
                  <description>HOST Control B</description>
                  <addressOffset>0x8</addressOffset>
                  <size>16</size>
                  <resetValue>0x0000</resetValue>
                  <fields>
                     <field>
                        <name>RESUME</name>
                        <description>Send USB Resume</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>SPDCONF</name>
                        <description>Speed Configuration for Host</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>2</bitWidth>
                        <enumeratedValues>
                           <name>SPDCONFSelect</name>
                           <enumeratedValue>
                              <name>NORMAL</name>
                              <description>Low and Full Speed capable</description>
                              <value>0x0</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>AUTORESUME</name>
                        <description>Auto Resume Enable</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>SOFE</name>
                        <description>Start of Frame Generation Enable</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>BUSRESET</name>
                        <description>Send USB Reset</description>
                        <bitOffset>9</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>VBUSOK</name>
                        <description>VBUS is OK</description>
                        <bitOffset>10</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>L1RESUME</name>
                        <description>Send L1 Resume</description>
                        <bitOffset>11</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>HSOFC</name>
                  <description>HOST Host Start Of Frame Control</description>
                  <addressOffset>0xA</addressOffset>
                  <size>8</size>
                  <resetValue>0x00</resetValue>
                  <fields>
                     <field>
                        <name>FLENC</name>
                        <description>Frame Length Control</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>4</bitWidth>
                     </field>
                     <field>
                        <name>FLENCE</name>
                        <description>Frame Length Control Enable</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>STATUS</name>
                  <description>HOST Status</description>
                  <addressOffset>0xC</addressOffset>
                  <size>8</size>
                  <resetValue>0x00</resetValue>
                  <fields>
                     <field>
                        <name>SPEED</name>
                        <description>Speed Status</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>2</bitWidth>
                     </field>
                     <field>
                        <name>LINESTATE</name>
                        <description>USB Line State Status</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>2</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>FSMSTATUS</name>
                  <description>Finite State Machine Status</description>
                  <addressOffset>0xD</addressOffset>
                  <size>8</size>
                  <access>read-only</access>
                  <resetValue>0x01</resetValue>
                  <fields>
                     <field>
                        <name>FSMSTATE</name>
                        <description>Fine State Machine Status</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>7</bitWidth>
                        <enumeratedValues>
                           <name>FSMSTATESelect</name>
                           <enumeratedValue>
                              <name>OFF</name>
                              <description>OFF (L3). It corresponds to the powered-off, disconnected, and disabled state</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>ON</name>
                              <description>ON (L0). It corresponds to the Idle and Active states</description>
                              <value>0x2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>SUSPEND</name>
                              <description>SUSPEND (L2)</description>
                              <value>0x4</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>SLEEP</name>
                              <description>SLEEP (L1)</description>
                              <value>0x8</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>DNRESUME</name>
                              <description>DNRESUME. Down Stream Resume.</description>
                              <value>0x10</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>UPRESUME</name>
                              <description>UPRESUME. Up Stream Resume.</description>
                              <value>0x20</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>RESET</name>
                              <description>RESET. USB lines Reset.</description>
                              <value>0x40</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>FNUM</name>
                  <description>HOST Host Frame Number</description>
                  <addressOffset>0x10</addressOffset>
                  <size>16</size>
                  <resetValue>0x0000</resetValue>
                  <fields>
                     <field>
                        <name>FNUM</name>
                        <description>Frame Number</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>11</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>FLENHIGH</name>
                  <description>HOST Host Frame Length</description>
                  <addressOffset>0x12</addressOffset>
                  <size>8</size>
                  <access>read-only</access>
                  <resetValue>0x00</resetValue>
                  <fields>
                     <field>
                        <name>FLENHIGH</name>
                        <description>Frame Length</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>8</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>INTENCLR</name>
                  <description>HOST Host Interrupt Enable Clear</description>
                  <addressOffset>0x14</addressOffset>
                  <size>16</size>
                  <resetValue>0x0000</resetValue>
                  <fields>
                     <field>
                        <name>HSOF</name>
                        <description>Host Start Of Frame Interrupt Disable</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>RST</name>
                        <description>BUS Reset Interrupt Disable</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>WAKEUP</name>
                        <description>Wake Up Interrupt Disable</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DNRSM</name>
                        <description>DownStream to Device Interrupt Disable</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>UPRSM</name>
                        <description>Upstream Resume from Device Interrupt Disable</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>RAMACER</name>
                        <description>Ram Access Interrupt Disable</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DCONN</name>
                        <description>Device Connection Interrupt Disable</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DDISC</name>
                        <description>Device Disconnection Interrupt Disable</description>
                        <bitOffset>9</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>INTENSET</name>
                  <description>HOST Host Interrupt Enable Set</description>
                  <addressOffset>0x18</addressOffset>
                  <size>16</size>
                  <resetValue>0x0000</resetValue>
                  <fields>
                     <field>
                        <name>HSOF</name>
                        <description>Host Start Of Frame Interrupt Enable</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>RST</name>
                        <description>Bus Reset Interrupt Enable</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>WAKEUP</name>
                        <description>Wake Up Interrupt Enable</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DNRSM</name>
                        <description>DownStream to the Device Interrupt Enable</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>UPRSM</name>
                        <description>Upstream Resume fromthe device Interrupt Enable</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>RAMACER</name>
                        <description>Ram Access Interrupt Enable</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DCONN</name>
                        <description>Link Power Management Interrupt Enable</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DDISC</name>
                        <description>Device Disconnection Interrupt Enable</description>
                        <bitOffset>9</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>INTFLAG</name>
                  <description>HOST Host Interrupt Flag</description>
                  <addressOffset>0x1C</addressOffset>
                  <size>16</size>
                  <resetValue>0x0000</resetValue>
                  <fields>
                     <field>
                        <name>HSOF</name>
                        <description>Host Start Of Frame</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>RST</name>
                        <description>Bus Reset</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>WAKEUP</name>
                        <description>Wake Up</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DNRSM</name>
                        <description>Downstream</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>UPRSM</name>
                        <description>Upstream Resume from the Device</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>RAMACER</name>
                        <description>Ram Access</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DCONN</name>
                        <description>Device Connection</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DDISC</name>
                        <description>Device Disconnection</description>
                        <bitOffset>9</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>PINTSMRY</name>
                  <description>HOST Pipe Interrupt Summary</description>
                  <addressOffset>0x20</addressOffset>
                  <size>16</size>
                  <access>read-only</access>
                  <resetValue>0x0000</resetValue>
                  <fields>
                     <field>
                        <name>EPINT0</name>
                        <description>Pipe 0 Interrupt</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>EPINT1</name>
                        <description>Pipe 1 Interrupt</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>EPINT2</name>
                        <description>Pipe 2 Interrupt</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>EPINT3</name>
                        <description>Pipe 3 Interrupt</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>EPINT4</name>
                        <description>Pipe 4 Interrupt</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>EPINT5</name>
                        <description>Pipe 5 Interrupt</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>EPINT6</name>
                        <description>Pipe 6 Interrupt</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>EPINT7</name>
                        <description>Pipe 7 Interrupt</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>DESCADD</name>
                  <description>Descriptor Address</description>
                  <addressOffset>0x24</addressOffset>
                  <size>32</size>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                     <field>
                        <name>DESCADD</name>
                        <description>Descriptor Address Value</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>32</bitWidth>
                     </field>
                  </fields>
               </register>
